app/Controllers/Configuracion.php

SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_nombre'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_rfc'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_telefono'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_email'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_direccion'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'ticket_leyenda'
 LIMIT 1
---
    public function index($activo=1)
    {
        $nombre = $this->configuracion->where('nombre','tienda_nombre')->first();
        $rfc = $this->configuracion->where('nombre','tienda_rfc')->first();
        $telefono = $this->configuracion->where('nombre','tienda_telefono')->first();
        $email = $this->configuracion->where('nombre','tienda_email')->first();
        $direccion = $this->configuracion->where('nombre','tienda_direccion')->first();
        $leyenda = $this->configuracion->where('nombre','ticket_leyenda')->first();